using System; // подключаемое пространство имен
using AddingNamespace; // подключаемое пространство имен, которое мы сделали

namespace StudentsExamples // объявление нового пространства имен
{
    class ProgramStructure   // объявление нового класса
    {
        static void main(string[] args) // объявление нового метода
        {
            Console.WriteLine("Hello World!"); // действия метода


             /*Блок очень важного кода, 
             * который нам нужно сохранить*/
            

        } // конец объявления нового метода

    } // конец объявления нового класса

} // конец объявления нового пространства имен














namespace AddingNamespace // объявление нового пространства имен
{
    class ProgramStructure   // объявление нового класса
    {
        static void main(string[] args) // объявление нового метода
        {
            Console.WriteLine("Hello World!"); // действия метода


            /*Блок очень важного кода, 
            * который нам нужно сохранить*/


        } // конец объявления нового метода

    } // конец объявления нового класса

} // конец объявления нового пространства имен